app/Controllers/Bus.php

SELECT *
FROM `jenis_bus`
---
    public function index()
    {
        $data['bus'] =  $this->busModel->getAll();
        $data['jenisbus'] =  $this->jenis_busModel->findAll();