app/Controllers/Jabatan.php

SELECT *
FROM `jabatan`
---
    public function index()
    {
        $data['jabatan'] =  $this->jabatanModel->findAll();

DELETE FROM `jabatan`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        $this->jabatanModel->delete($id);