app/Controllers/Karyawan.php

SELECT *
FROM `jabatan`
---
    public function index()
    {
        $data['karyawan'] =  $this->karyawanModel->getAll();
        $data['jabatan'] =  $this->jabatanModel->findAll();

INSERT INTO `karyawan` (`nama_karyawan`, `alamat`, `nohp`, `id_jabatan`) VALUES ('Guntur', 'Banuaran', '08956565786', '1')
---
    public function save()
    {
        $id = $this->request->getPost('id');

        $data = [
            'nama_karyawan' => $this->request->getPost('nama_karyawan'),
            'alamat' => $this->request->getPost('alamat'),
            'nohp' => $this->request->getPost('nohp'),
            'id_jabatan' => $this->request->getPost('id_jabatan'),
        ];

        if ($id) {
            // Update
            $this->karyawanModel->update($id, $data);
            session()->setFlashdata('success', 'Data berhasil diperbarui');
        } else {
            // Insert
            $this->karyawanModel->insert($data);