app/Controllers/Laporanpemesanan.php

SELECT `pemesanan`.*, `penyewa`.`nama_penyewa`, `paket_wisata`.`nama_paket`
FROM `pemesanan`
JOIN `penyewa` ON `penyewa`.`id` = `pemesanan`.`id_penyewa`
JOIN `paket_bus` ON `paket_bus`.`id` = `pemesanan`.`id_paketbus`
JOIN `paket_wisata` ON `paket_wisata`.`id` = `paket_bus`.`id_paketwisata`
---
    public function index()
    {
        $data['pemesanan'] = $this->pemesananModel->select('pemesanan.*, penyewa.nama_penyewa, paket_wisata.nama_paket')
            ->join('penyewa', 'penyewa.id = pemesanan.id_penyewa')
            ->join('paket_bus', 'paket_bus.id = pemesanan.id_paketbus')
            ->join('paket_wisata', 'paket_wisata.id = paket_bus.id_paketwisata')
            ->findAll();