app/Controllers/Laporanpemesanandetail.php

    public function cetak()
    {
        $data['pemesananDetail'] = $this->pemesananDetailModel->select('pemesanan_detail.*, pemesanan.id as no_pemesanan')
            ->join('pemesanan', 'pemesanan.id = pemesanan_detail.id_pemesanan')
            ->findAll();
---
SELECT `pemesanan_detail`.*, `pemesanan`.`id` as `no_pemesanan`
FROM `pemesanan_detail`
JOIN `pemesanan` ON `pemesanan`.`id` = `pemesanan_detail`.`id_pemesanan`