app/Controllers/Login.php

    public function dashboard()
    {
        $session = session();

        // Cek apakah user sudah login
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Ambil statistik dari database
        $db = \Config\Database::connect();

        $totalPenyewa = $db->table('penyewa')->countAllResults();
        $totalBus = $db->table('bus')->countAllResults();
        $totalPaketWisata = $db->table('paket_wisata')->countAllResults();
        $totalPemesanan = $db->table('pemesanan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `penyewa`

        $randomQuote = $quotes[array_rand($quotes)];
        $randomFunFact = $funFacts[array_rand($funFacts)];

        $data = [
            'user_name' => $session->get('user_name'),
            'user_role' => $session->get('user_role'),
            'user_email' => $session->get('user_email'),
            'user_foto' => $session->get('user_foto'),
            'total_penyewa' => $totalPenyewa,
            'total_bus' => $totalBus,
            'total_paket_wisata' => $totalPaketWisata,
            'total_pemesanan' => $totalPemesanan,
            'quote' => $randomQuote,
            'funFact' => $randomFunFact
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `paket_wisata`
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`