app/Controllers/Pemberangkatan.php

SELECT *
FROM `pemesanan`
SELECT *
FROM `karyawan`
---
    public function index()
    {
        $data = [
            'pemberangkatan' => $this->pemberangkatanModel->getAll(),
            'pemesanan' => $this->pemesananModel->findAll(),
            'bus' => $this->busModel->findAll(),
            'karyawan' => $this->karyawanModel->findAll(),