app/Controllers/Pemesanan.php

SELECT *
FROM `penyewa`
---
    public function index()
    {
        $data = [
            'pemesanan' => $this->pemesananModel->getAll(),
            'penyewa' => $this->penyewaModel->findAll(),
            'paketbus' => $this->paketbusModel->getAll(),
        ];