app/Controllers/Register.php

    public function store()
    {
        $role = $this->request->getPost('role');
        $nama = $this->request->getPost('nama');
        $email = $this->request->getPost('email');
        $password = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);
        $alamat = $this->request->getPost('alamat');
        $nohp = $this->request->getPost('nohp');

        if ($role == 'karyawan') {
            $model = new \App\Models\KaryawanModel();
            $model->insert([
                'nama_karyawan' => $nama,
                'email'         => $email,
                'nohp'          => $nohp,
                'password'      => $password,
                'alamat'        => $alamat,
                'id_jabatan'    => $this->request->getPost('id_jabatan'),
            ]);
        } elseif ($role == 'penyewa') {
            $model = new \App\Models\PenyewaModel();
            $model->insert([
                'nama_penyewa' => $nama,
                'email'        => $email,
                'no_telp'      => $nohp,
                'password'     => $password,
                'alamat'       => $alamat,
            ]);
---
INSERT INTO `penyewa` (`nama_penyewa`, `email`, `no_telp`, `password`, `alamat`) VALUES ('Guntur Lailam Yuro', 'lailamyuro2@gmail.com', '0895602572476', '$2y$10$FqyRr0Zl82xy.Pu.FQ2NMug2KOr.MJxcmyS2lNL9ZQOFPFechRBee', 'Jl Banuaran No 19')