app/Models/KaryawanModel.php

    public function getAll()
    {
        return $this->select('karyawan.id,jabatan.nama_jabatan, karyawan.nama_karyawan, karyawan.alamat,karyawan.nohp, karyawan.id_jabatan')
            ->join('jabatan', 'jabatan.id = karyawan.id_jabatan', 'left')
            ->findAll();
---
SELECT `karyawan`.`id`, `jabatan`.`nama_jabatan`, `karyawan`.`nama_karyawan`, `karyawan`.`alamat`, `karyawan`.`nohp`, `karyawan`.`id_jabatan`
FROM `karyawan`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`id_jabatan`