app/Models/PaketbusModel.php

SELECT `paket_bus`.`id`, `paket_bus`.`id_paketwisata`, `paket_bus`.`id_bus`, `paket_wisata`.`nama_paket`, `paket_wisata`.`harga`, `bus`.`nomor_polisi`, `bus`.`merek`
FROM `paket_bus`
LEFT JOIN `paket_wisata` ON `paket_wisata`.`id` = `paket_bus`.`id_paketwisata`
LEFT JOIN `bus` ON `bus`.`id` = `paket_bus`.`id_bus`
---
    public function getAll()
    {
        return $this->select('paket_bus.id, paket_bus.id_paketwisata, paket_bus.id_bus, paket_wisata.nama_paket, paket_wisata.harga, bus.nomor_polisi, bus.merek')
            ->join('paket_wisata', 'paket_wisata.id = paket_bus.id_paketwisata', 'left')
            ->join('bus', 'bus.id = paket_bus.id_bus', 'left')
            ->findAll();