app/Models/PemberangkatanModel.php

    public function getAll()
    {
        return $this->select('pemberangkatan.*, pemesanan.id as kode_pemesanan, penyewa.nama_penyewa, bus.nomor_polisi, bus.merek, sopir.nama_karyawan as nama_sopir, kernet.nama_karyawan as nama_kernet')
            ->join('pemesanan', 'pemesanan.id = pemberangkatan.id_pemesanan', 'left')
            ->join('penyewa', 'penyewa.id = pemesanan.id_penyewa', 'left')
            ->join('bus', 'bus.id = pemberangkatan.id_bus', 'left')
            ->join('karyawan as sopir', 'sopir.id = pemberangkatan.id_sopir', 'left')
            ->join('karyawan as kernet', 'kernet.id = pemberangkatan.id_kernet', 'left')
            ->findAll();
---
SELECT `pemberangkatan`.*, `pemesanan`.`id` as `kode_pemesanan`, `penyewa`.`nama_penyewa`, `bus`.`nomor_polisi`, `bus`.`merek`, `sopir`.`nama_karyawan` as `nama_sopir`, `kernet`.`nama_karyawan` as `nama_kernet`
FROM `pemberangkatan`
LEFT JOIN `pemesanan` ON `pemesanan`.`id` = `pemberangkatan`.`id_pemesanan`
LEFT JOIN `penyewa` ON `penyewa`.`id` = `pemesanan`.`id_penyewa`
LEFT JOIN `bus` ON `bus`.`id` = `pemberangkatan`.`id_bus`
LEFT JOIN `karyawan` as `sopir` ON `sopir`.`id` = `pemberangkatan`.`id_sopir`
LEFT JOIN `karyawan` as `kernet` ON `kernet`.`id` = `pemberangkatan`.`id_kernet`

    public function getDaftarTujuan(): array
    {
        return $this->db->table('paket_wisata')
            ->select('tujuan')
            ->distinct() // Cara benar di CI4
            ->where('tujuan IS NOT NULL')
            ->orderBy('tujuan', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT DISTINCT `tujuan`
FROM `paket_wisata`
WHERE `tujuan` IS NOT NULL
ORDER BY `tujuan` ASC