app/Models/PembayaranModel.php

    public function getPembayaranList()
    {
        // Menampilkan SEMUA pemesanan dengan status pembayaran (lunas/belum bayar)
        return $this->db->table('pemesanan')
            ->select('
                pemesanan.id,
                pemesanan.id as id_pemesanan,
                pemesanan.tanggal_pesan,
                pemesanan.total_bayar,
                pembayaran.id as pembayaran_id,
                pembayaran.tanggal_bayar,
                pembayaran.jumlah_bayar,
                pembayaran.metode_bayar,
                pembayaran.bukti_bayar,
                pemesanan_detail.tanggal_berangkat,
                pemesanan_detail.tanggal_kembali,
                penyewa.nama_penyewa,
                paket_wisata.nama_paket,
                paket_wisata.tujuan
            ')
            ->join('penyewa', 'penyewa.id = pemesanan.id_penyewa', 'left')
            ->join('paket_bus', 'paket_bus.id = pemesanan.id_paketbus', 'left')
            ->join('paket_wisata', 'paket_wisata.id = paket_bus.id_paketwisata', 'left')
            ->join('pemesanan_detail', 'pemesanan_detail.id_pemesanan = pemesanan.id', 'left')
            ->join('pembayaran', 'pembayaran.id_pemesanan = pemesanan.id', 'left')
            ->orderBy('pemesanan.id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `pembayaran`.`id`, `pembayaran`.`id_pemesanan`, `pembayaran`.`tanggal_bayar`, `pembayaran`.`jumlah_bayar`, `pembayaran`.`metode_bayar`, `pembayaran`.`bukti_bayar`, `pemesanan`.`tanggal_pesan`, `pemesanan`.`total_bayar`, `pemesanan_detail`.`tanggal_berangkat`, `pemesanan_detail`.`tanggal_kembali`, `paket_wisata`.`nama_paket`, `paket_wisata`.`tujuan`
FROM `pembayaran`
INNER JOIN `pemesanan` ON `pemesanan`.`id` = `pembayaran`.`id_pemesanan`
LEFT JOIN `pemesanan_detail` ON `pemesanan_detail`.`id_pemesanan` = `pembayaran`.`id_pemesanan`
LEFT JOIN `paket_bus` ON `paket_bus`.`id` = `pemesanan`.`id_paketbus`
LEFT JOIN `paket_wisata` ON `paket_wisata`.`id` = `paket_bus`.`id_paketwisata`
ORDER BY `pembayaran`.`id` DESC

    public function getPemesananBelumBayar()
    {
        return $this->db->table('pemesanan')
            ->select('
                pemesanan.id,
                pemesanan.tanggal_pesan,
                pemesanan.total_bayar,
                penyewa.nama_penyewa,
                paket_wisata.nama_paket,
                paket_wisata.tujuan,
                pemesanan_detail.tanggal_berangkat,
                pemesanan_detail.tanggal_kembali
            ')
            ->join('penyewa', 'penyewa.id = pemesanan.id_penyewa', 'left')
            ->join('paket_bus', 'paket_bus.id = pemesanan.id_paketbus', 'left')
            ->join('paket_wisata', 'paket_wisata.id = paket_bus.id_paketwisata', 'left')
            ->join('pemesanan_detail', 'pemesanan_detail.id_pemesanan = pemesanan.id', 'left')
            ->where('pemesanan.id NOT IN (SELECT id_pemesanan FROM pembayaran)', null, false)
            ->get()
            ->getResultArray();
---
SELECT `pemesanan`.`id`, `pemesanan`.`tanggal_pesan`, `pemesanan`.`total_bayar`, `penyewa`.`nama_penyewa`, `paket_wisata`.`nama_paket`, `paket_wisata`.`tujuan`, `pemesanan_detail`.`tanggal_berangkat`, `pemesanan_detail`.`tanggal_kembali`
FROM `pemesanan`
LEFT JOIN `penyewa` ON `penyewa`.`id` = `pemesanan`.`id_penyewa`
LEFT JOIN `paket_bus` ON `paket_bus`.`id` = `pemesanan`.`id_paketbus`
LEFT JOIN `paket_wisata` ON `paket_wisata`.`id` = `paket_bus`.`id_paketwisata`
LEFT JOIN `pemesanan_detail` ON `pemesanan_detail`.`id_pemesanan` = `pemesanan`.`id`
WHERE pemesanan.id NOT IN (SELECT id_pemesanan FROM pembayaran)