app/Models/PemesananModel.php

    public function getAll()
    {
        return $this->select('pemesanan.*, penyewa.nama_penyewa, paket_bus.id as kode_paketbus, paket_wisata.nama_paket')
            ->join('penyewa', 'penyewa.id = pemesanan.id_penyewa', 'left')
            ->join('paket_bus', 'paket_bus.id = pemesanan.id_paketbus', 'left')
            ->join('paket_wisata', 'paket_wisata.id = paket_bus.id_paketwisata', 'left')
            ->findAll();
---
SELECT `pemesanan`.*, `penyewa`.`nama_penyewa`, `paket_bus`.`id` as `kode_paketbus`, `paket_wisata`.`nama_paket`
FROM `pemesanan`
LEFT JOIN `penyewa` ON `penyewa`.`id` = `pemesanan`.`id_penyewa`
LEFT JOIN `paket_bus` ON `paket_bus`.`id` = `pemesanan`.`id_paketbus`
LEFT JOIN `paket_wisata` ON `paket_wisata`.`id` = `paket_bus`.`id_paketwisata`