app/Models/PemesananDetailModel.php

    public function getAll()
    {
        return $this->withPaymentSelect()
            ->findAll();
---
SELECT `pemesanan_detail`.*, `pemesanan`.`tanggal_pesan`, `penyewa`.`nama_penyewa`
FROM `pemesanan_detail`
LEFT JOIN `pemesanan` ON `pemesanan`.`id` = `pemesanan_detail`.`id_pemesanan`
LEFT JOIN `penyewa` ON `penyewa`.`id` = `pemesanan`.`id_penyewa`