app/Models/UserModel.php

    public function findKaryawanByEmail(string $email): ?array
    {
        $db = \Config\Database::connect();
        $row = $db->table('karyawan')
            ->select('id, nama_karyawan AS name, email, nohp AS phone, password')
            ->where('email', $email)
            ->get()
            ->getRowArray();
---
SELECT `id`, `nama_karyawan` AS `name`, `email`, `nohp` AS `phone`, `password`
FROM `karyawan`
WHERE `email` = 'gunturlailamyuro8@gmail.com'